#!/usr/bin/php -q
<?
include_once('debug.php');
#include_once('uniord.php');

$cont = file_get_contents('tp.grep.uniq');

$cont = preg_replace(
	array(
		'/:0GH/',#Б
		'/:0GJ/',#Г
		'/:0GL/',#Е
		'/:0GN/',#З
		'/:0GQ/',#К
		'/:0GY/',#Т


		'/:0Gm/',#а
		'/:0Gn/',#б
		'/:0Go/',#в
		'/:0Gq/',#д
		'/:0Gr/',#е
		'/:0Gt/',#з
		'/:0Gu/',#и
		'/:0Gv/',#й
		'/:0Gw/',#к
		'/:0Gx/',#л
		'/:0Gy/',#м
		'/:0Gz/',#н
		'/:0G\+/',#о
		'/:0G-/',#п
		'/:0H0/',#р
		'/:0H1/',#с
		'/:0H2/',#т
		'/:0H3/',#у
		'/:0H5/',#х
		'/:0H8/',#ш
		'/:0HC/',#ь
		'/:0HE/',#ю
		'/:0HF/',#я
	),
	array(
#		'А',
		'Б',
#		'В',
		'Г',
#		'Д',
		'Е',
#		'Ё','Ж',
		'З',
#		'И','Й',
		'К',
#		'Л','М','Н','О','П','Р','С',
		'Т',
#		'У','Ф','Х','Ц','Ч','Ш','Щ','Ь','Ы','Ъ','Э','Ю','Я'

		'а','б','в',
#		'г',
		'д','е',
#		'ё','ж',
		'з','и','й',
		'к','л','м','н','о','п','р','с','т','у',
#		'ф',
		'х',
#		'ц','ч',
		'ш',
#		'щ',
		'ь',
#		,'ы','ъ','э',
		'ю','я'
	),
	$cont
);
c_dump($cont);
?>